### Create Temperature Data

In [25]:
import numpy as np
import pandas as pd
from datetime import date, timedelta

n = 12
# random temperature with mean 22 and std 15
tempreture = np.random.randn(n)*15 + 22

# past 20 days date
dates=pd.Series(np.arange(n)).map(lambda x: date.today() + timedelta(days=-x))

temp_centigrade = pd.DataFrame({"dates":dates, "temps":tempreture})

temp_centigrade

         dates      temps
0   2019-03-02  46.284466
1   2019-03-01  31.305035
2   2019-02-28  27.842711
3   2019-02-27  42.477943
4   2019-02-26  41.640860
5   2019-02-25  18.432907
6   2019-02-24  11.167314
7   2019-02-23  38.336743
8   2019-02-22  29.632677
9   2019-02-21  25.945280
10  2019-02-20  44.286649
11  2019-02-19  25.955067

### Convert Temperature

In [26]:
temp_fahrenheit = temp_centigrade["temps"].map(lambda temp: temp*9/5+32)

temp_fahrenheit

0     115.312038
1      88.349063
2      82.116881
3     108.460297
4     106.953547
5      65.179232
6      52.101166
7     101.006138
8      85.338819
9      78.701504
10    111.715967
11     78.719120
Name: temps, dtype: float64

### Replace Value

In [27]:
series = pd.Series(np.random.choice(range(-2,5), 12))

display(series.replace(-2, np.nan))

display(series.replace({-2:np.nan, -1:999}))

0     NaN
1    -1.0
2     NaN
3     4.0
4     4.0
5     1.0
6     1.0
7    -1.0
8    -1.0
9     NaN
10    4.0
11   -1.0
dtype: float64

0       NaN
1     999.0
2       NaN
3       4.0
4       4.0
5       1.0
6       1.0
7     999.0
8     999.0
9       NaN
10      4.0
11    999.0
dtype: float64

### Index Transformation

In [37]:
rand_temps = np.random.randn(n)*15 + 22
rand_temps = pd.Series(rand_temps)
display(rand_temps)
rand_temps.index = rand_temps.index.map(lambda x: date.today()+timedelta(days=-x))
rand_temps

0     22.146457
1     12.664544
2     29.787994
3     14.898466
4     30.994001
5     25.406674
6     16.688935
7      6.376563
8     56.172849
9     51.709424
10    18.442156
11    -1.498248
dtype: float64

2019-03-02    22.146457
2019-03-01    12.664544
2019-02-28    29.787994
2019-02-27    14.898466
2019-02-26    30.994001
2019-02-25    25.406674
2019-02-24    16.688935
2019-02-23     6.376563
2019-02-22    56.172849
2019-02-21    51.709424
2019-02-20    18.442156
2019-02-19    -1.498248
dtype: float64

### Rename

In [41]:
data = pd.DataFrame(np.arange(12).reshape(4,3), 
                    index=['state1', 'state2', 'state3', 'state4'],
                    columns=['one', 'two', 'three']
                   )
display(data)
data.rename(index=str.upper, columns=str.title)

        one  two  three
state1    0    1      2
state2    3    4      5
state3    6    7      8
state4    9   10     11

        One  Two  Three
STATE1    0    1      2
STATE2    3    4      5
STATE3    6    7      8
STATE4    9   10     11

In [43]:
data.rename(index={'state3':'kathmandu'}, columns={'two':'duye'})

           one  duye  three
state1       0     1      2
state2       3     4      5
kathmandu    6     7      8
state4       9    10     11